examples/thickenedFlameOodles/pitzDaily3D/constant/sourceTermProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          thermophysicalProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

sourceTermModel airmix;

airmixCoeffs
{
 A 1.6e09;
 TA 7048.0;
 MF 1;
 nuF 1;
 nuO 1;
 phi 0.6;
 stoichiometricAirFuelMassRatio 1.0;
}

// ************************************************************************* //
