examples/thickenedFlameOodles/pitzDaily3D/constant/thermophysicalProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          thermophysicalProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType      hPsiMixtureThermo<homogeneousMixture<sutherlandTransport<specieThermo<janafThermo<perfectGas>>>>>;

stoichiometricAirFuelMassRatio stoichiometricAirFuelMassRatio [0 0 0 0 0 0 0] 15.675;

fuel            fuel 1 44.0962 200 5000 1000 7.53414 0.0188722 -6.27185e-06 9.14756e-10 -4.78381e-14 -16467.5 -17.8923 0.933554 0.0264246 6.10597e-06 -2.19775e-08 9.51493e-12 -13958.5 19.2017 1.67212e-06 170.672;

oxidant         oxidant 1 28.8504 200 6000 1000 3.10205 0.00123963 -4.17512e-07 6.60292e-11 -3.87448e-15 -985.517 5.35187 3.58378 -0.0007269 1.66985e-06 -1.08452e-10 -4.31951e-13 -1050.53 3.11223 1.67212e-06 170.672;

reactants       reactants 42.7719 29.48 200 5000 1000 3.26219 1.90578e-03 -6.70778e-07 1.11111e-10 -6.95161e-15 -1.54131e+03 4.51236 3.19463 2.23757e-03 -2.87044e-06 3.71954e-09 -1.67996e-12 -1.47394e+03 4.96249 1.67212e-06 170.672;

products        products 43.77 29.51 200 5000 1000 3.14783 1.66858e-03 -6.18315e-07 1.08664e-10 -7.24004e-15 -7.70209e+03 5.02868 3.18736 2.40015e-03 -4.45514e-06 5.42944e-09 -2.2623e-12 -7.70765e+03 4.7326 1.67212e-06 170.672;

burntProducts   burntProducts 25.8095 28.3233 200 6000 1000 3.106 0.00179682 -5.94382e-07 9.04998e-11 -5.08033e-15 -11003.7 5.11872 3.49612 0.000650364 -2.08029e-07 1.2291e-09 -7.73697e-13 -11080.3 3.18978 1.67212e-06 170.672;

/*
thermoType      hhuMixtureThermo<homogeneousMixture<constTransport<specieThermo<hConstThermo<perfectGas>>>>>;

stoichiometricAirFuelMassRatio stoichiometricAirFuelMassRatio [0 0 0 0 0 0 0] 9.286;

reactants       reactants 1 28 1330.9 2.133e+06 1.798e-05 0.7;

products        products 1 28 1579.9 0 5.016e-05 0.7;
*/

// ************************************************************************* //

