examples/thickenedFlameOodles/pitzDaily3D/system/fvSolution
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver  PCG;
        preconditioner DIC;
        minIter          0;
        maxIter          2000;
        tolerance        1e-05;
        relTol           0;
    };
    p PCG
    {
        solver PCG;
        preconditioner DIC;
        minIter          0;
        maxIter          2000;
        tolerance        1e-06;
        relTol           0;
    };
    "(U|ft|fu|b|h|R|k|epsilon)"
    {
        solver  PBiCG;
        preconditioner DILU;
        minIter          0;
        maxIter          500;
        tolerance        1e-05;
        relTol           0;
    };
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
}


// ************************************************************************* //
